status_code_map = {
    17701: ("图片大小过大", 413),
    17702: ("服务器繁忙，请重试", 500),
    17799: ("不明错误发生", 500),
    17703: ("请求参数不正确", 500),
    17704: ("API维护中", 403),
    17705: ("图片格式不支持", 500),
    17706: ("识别无法完成（内部错误，请重试）", 500),
    17707: ("内部错误", 500),
    17708: ("图片中的人物数量超过限制", 500),
    17709: ("无法加载统计数量", 500),
    17710: ("图片验证码错误", 500),
    17711: ("无法完成识别前准备工作（请重试）", 500),
    17712: ("需要图片名称", 500),
    17720: ("识别成功", 200),
}

def handle_status_code(code: int):
    return status_code_map.get(code, ("未知错误", 500))
